---
kind: property
id: P:Autodesk.Revit.DB.DimensionType.Suffix
source: html/1caee7d4-8990-7790-f41b-fb03166d7c58.htm
---
# Autodesk.Revit.DB.DimensionType.Suffix Property

The suffix text for the dimension value.

## Syntax (C#)
```csharp
public string Suffix { get; set; }
```

## Remarks
The text goes immediately after the value and is not overridden by the possible instance suffix.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null